---
kind: method
id: M:Autodesk.Revit.DB.WireframeBuilder.#ctor
source: html/9ad33091-ea5c-81a8-aee8-6d8fa33e1a6d.htm
---
# Autodesk.Revit.DB.WireframeBuilder.#ctor Method

Default constructor.

## Syntax (C#)
```csharp
public WireframeBuilder()
```